---
title: "XML Days Europe 2000"
date: 2000-10-27
categories: news eventi
---
L'Ufficio Italiano partecipa alla tavola rotonda di <a href="http://www.ltt.de/xml_days.2000/milan.html">XML Days Europe - Milan</a>
---
title: Contatti W3C-IT
layout: page
---
<p>L'<a href="/">Ufficio W3C Italiano</a> &egrave; ospitato dal Consiglio Nazionale delle Ricerche (<a title="sito CNR" href="http://www.cnr.it/">C.N.R.</a>) e gestito congiuntamente dalll' <a href="http://www.isti.cnr.it/">Istituto di Scienza e Tecnologie dell' Informazione "A. Faedo"</a> (ISTI) e dall' <a href="http://www.iit.cnr.it/">Istituto di Informatica e Telematica</a> (IIT), entrambi situati a Pisa.</p>

<p>Il C.N.R. (Consiglio Nazionale delle Ricerche) &egrave; <em>"Ente nazionale di ricerca con competenza scientifica generale e istituti scientifici distribuiti sul territorio, che svolge attivit&agrave; di prioritario interesse per l'avanzamento della scienza e per il progresso del Paese"</em>.</p>

<p>Ha personalit&agrave; giuridica di diritto pubblico e si dota di un ordinamento autonomo in conformit&agrave; alle regole stabilite dalle leggi vigenti o per quanto non previsto dalle precedenti leggi, al Codice Civile.</p><p>Al CNR sono attribuite le seguenti attivit&agrave; e finalit&agrave;:</p>

<ul class="show_items">
    <li>svolge e promuove attivit&agrave; di ricerca con obiettivi di eccellenza e di rilevanza strategica in ambito nazionale e internazionale, nel quadro della cooperazione e integrazione europea e della collaborazione con la ricerca universitaria e di altri soggetti pubblici e privati, assicurando la diffusione dei risultati all'interno del Paese;</li>
    <li>nell'ambito del proprio piano triennale di attivit&agrave; e nel quadro della collaborazione con le universit&agrave; ed altri soggetti pubblici e privati progetta, dirige, e coordina programmi nazionali e internazionali di ricerca, nonch&eacute; sostiene attivit&agrave; scientifiche e di ricerca di rilevante interesse per il sistema nazionale;</li>
    <li>cura la valorizzazione, lo sviluppo precompetitivo e il trasferimento tecnologico dei risultati della ricerca svolta dalla propria rete scientifica e da soggetti terzi, con cui intrattenere rapporti convenzionali;</li>
    <li>cura la collaborazione nel campo scientifico, tecnologico e della normativa tecnica con enti e istituzioni di altri Paesi o con organismi sovranazionali relativamente agli accordi di carattere non governativo e fornisce, su richiesta di autorit&agrave; governative, competenze specifiche per la partecipazione nazionale ad organizzazioni o a programmi scientifici internazionali a carattere intergovernativo;</li>
    <li>svolge anche attraverso propri programmi di assegnazione di borse di studio e di ricerca, attivit&agrave; di formazione nei corsi universitari di dottorato di ricerca, attivit&agrave; di alta formazione postuniversitaria, di formazione permanente, continua e ricorrente. Pu&ograve; altres&igrave; svolgere attivit&agrave; di formazione superiore non universitaria;
    </li>
    <li>svolge attivit&agrave; di vigilanza sugli enti che assolvono le funzioni di organismo di normalizzazione, di cui alla Legge 21 giugno 1986, n. 317, attivit&agrave; di diffusione di specifiche tecniche nell'ambito dei compiti istituzionali, nonch&eacute; attivit&agrave; di certificazione, prova e accreditamento per le pubbliche amministrazioni, su loro richiesta;</li>
    <li>fornisce supporto tecnico-scientifico alle amministrazioni pubbliche su loro richiesta;</li>
    <li>nell'ambito del perseguimento delle proprie attivit&agrave; istituzionali pu&ograve; fornire servizi a terzi in regime di diritto privato.</li>
</ul>

<p>Per lo svolgimento delle attivit&agrave; sopra enunciate e di ogni altra attivit&agrave; connessa, ivi compreso l'utilizzo economico dei risultati della propria ricerca, il CNR, pu&ograve; stipulare accordi e convenzioni, partecipare o costituire consorzi, fondazioni o societ&agrave; con soggetti pubblici e privati, italiani e stranieri.</p>

<p>Inoltre con convenzioni o partecipazioni pu&ograve; dare applicazione anche a normative, indirizzi o programmi delle regioni o di altri soggetti pubblici, rivolte alla diffusione dei risultati della ricerca nel sistema economico e pu&ograve;, altres&igrave;, contribuire a determinare le condizioni per la costituzione di imprese altamente innovative.</p>

<p>Pu&ograve;, infine, partecipare a centri di ricerca internazionali in collaborazione con analoghe istituzioni scientifiche di altri Paesi.</p>

<p><img src="/assets/images/oreste.png" alt="Foto di Oreste" width="110" /> <a href="mailto:oreste@w3c.it">Oreste Signore</a> &egrave; il Manager dell'Ufficio Italiano (<a href="http://www.weblab.isti.cnr.it/people/oreste/">Home page</a>).</p>

<p><img src="/assets/images/gio.jpg" alt="Foto di Gioacchino" width="104" height="131" /> <a href="mailto:gio@w3c.it">Gioacchino La Vecchia</a> &egrave; l'Administrator dell'Ufficio.</p>

<p><strong>Contatti</strong></p><p>Indirizzo:</p><p>Ufficio Italiano W3C presso il C.N.R.<br /> ISTI<br /> Area della Ricerca di Pisa-San Cataldo<br /> via G. Moruzzi, 1<br /> 56124 Pisa</p><p>Tel: +39 3483962627</p><p>Email: <a href="mailto:w3c@w3c.it">w3c@w3c.it</a></p>  
